dev_tools.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-10-25 pon 19:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>dev_tools</title>
<meta name="author" content="Michał 'wiitd' KM" />
<meta name="description" content="list of tools, libraries, frameworks, game engines, languages for game and app development" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://cdn.jsdelivr.net/npm/bulma@0.9.3/css/bulma.min.css">
<link rel="stylesheet" type="text/css" href="https://unpkg.com/bulma-prefers-dark" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">dev<sub>tools</sub></h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1c30f55">libs</a></li>
<li><a href="#org9795fef">frameworks</a></li>
<li><a href="#org9417a8a">game engine (+editor)</a></li>
<li><a href="#orgc6373b8">game engine (-editor)</a></li>
<li><a href="#org1e8bd5b">fantasy consoles</a></li>
<li><a href="#orgec88d1f">others</a></li>
<li><a href="#org743fc11">software</a></li>
</ul>
</div>
</div>
<p>
!!! disclaimer: list contains only software i used/consider good, almost every entry here is FOSS or free and source available
</p>

<p>
no unity, ue, cryengine, [insert popular game engine name],&#x2026;, they are/might be good but lacks some things i consider essential like small size, lightweight, portable
</p>

<ul class="org-ul">
<li>name
<ul class="org-ul">
<li>(langs) &lt;- official support</li>
<li>{bindings} &lt;- community maintained</li>
<li>[platforms] &lt;- works on or can export/compile to</li>
</ul></li>
</ul>

<div id="outline-container-org1c30f55" class="outline-2">
<h2 id="org1c30f55">libs</h2>
<div class="outline-text-2" id="text-org1c30f55">
<ul class="org-ul">
<li><a href="https://www.raylib.com/">raylib</a>
<ul class="org-ul">
<li>(c/cpp)</li>
<li>{csharp, lua, haxe, freebasic, go,&#x2026;}</li>
<li>[linux, mac, win, mobile, web]</li>
</ul></li>

<li><a href="https://www.libsdl.org/">sdl</a>
<ul class="org-ul">
<li>(c/cpp)</li>
<li>{csharp, lua, haxe, freebasic, go,&#x2026;}</li>
<li>[linux, mac, win, web, mobile,&#x2026;]</li>
</ul></li>

<li><a href="http://www.tilengine.org/index.htm">tilengine</a>
<ul class="org-ul">
<li>(c/cpp)</li>
<li>{csharp, python, pascal, freebasic, java,&#x2026;}</li>
<li>[linux, mac, win]</li>
</ul></li>

<li><a href="https://liballeg.org/">allegro</a>
<ul class="org-ul">
<li>(c/cpp)</li>
<li>{freebasic,&#x2026;}</li>
<li>[linux, mac, win]</li>
</ul></li>

<li><a href="https://ebiten.org/">ebiten</a>
<ul class="org-ul">
<li>(go)</li>
<li>[linux, mac, win, mobile, web, switch]</li>
</ul></li>

<li><a href="https://github.com/faiface/pixel">pixel</a>
<ul class="org-ul">
<li>(go)</li>
<li>[linux, mac, win]</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9795fef" class="outline-2">
<h2 id="org9795fef">frameworks</h2>
<div class="outline-text-2" id="text-org9795fef">
<ul class="org-ul">
<li><a href="https://love2d.org/">love2d</a>
<ul class="org-ul">
<li>(lua)</li>
<li>[linux, mac, win, mobile, *web] * developed by comunity</li>
</ul></li>

<li><a href="https://lovr.org/">lovr</a>
<ul class="org-ul">
<li>(lua)</li>
<li>[linux, mac, win, android, web]</li>
</ul></li>

<li><a href="https://www.amulet.xyz/">amulet</a>
<ul class="org-ul">
<li>(lua)</li>
<li>[linux, mac, win, mobile, web]</li>
</ul></li>

<li><a href="https://haxepunk.com/">haxepunk</a>
<ul class="org-ul">
<li>(haxe)</li>
<li>[linux, mac, win, web]</li>
</ul></li>

<li><a href="https://libgdx.com/">libgdx</a>
<ul class="org-ul">
<li>(java)</li>
<li>[linux, mac, win, mobile, web]</li>
</ul></li>

<li><a href="https://github.com/Kode/Kha">kha</a>
<ul class="org-ul">
<li>(haxe)</li>
<li>[linux, mac, linux, mobile, web, consoles,&#x2026;, unity3d?!]</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org9417a8a" class="outline-2">
<h2 id="org9417a8a">game engine (+editor)</h2>
<div class="outline-text-2" id="text-org9417a8a">
<ul class="org-ul">
<li><a href="https://godotengine.org/">godot</a>
<ul class="org-ul">
<li>(cpp, gdscript, csharp, codeless)</li>
<li>{rust, lua, nim}</li>
<li>[linux, mac, win, web]</li>
</ul></li>

<li><a href="https://defold.com/">defold</a>
<ul class="org-ul">
<li>(lua)</li>
<li>{haxe}</li>
<li>[linux, mac, win, mobile, web, switch]</li>
</ul></li>

<li><a href="https://gdevelop-app.com/">gdevelop</a>
<ul class="org-ul">
<li>(codeless, js)</li>
<li>[linux, mac, win, web]</li>
</ul></li>

<li><a href="https://www.monogame.net/">monogame</a>
<ul class="org-ul">
<li>(csharp)</li>
<li>[linux, mac, win, mobile, web, consoles,&#x2026;]</li>
</ul></li>

<li><a href="https://waveengine.net/">wave engine</a>
<ul class="org-ul">
<li>(csharp)</li>
<li>[linux, mac, win, mobile, web, consoles,&#x2026;]</li>
</ul></li>

<li><a href="https://flatredball.com/">flatredball</a>
<ul class="org-ul">
<li>(csharp)</li>
<li>[win, mobile]</li>
</ul></li>

<li><a href="https://fna-xna.github.io/">fna</a>
<ul class="org-ul">
<li>(csharp)</li>
<li>[linux, mac, win, mobile, web, consoles,&#x2026;]</li>
</ul></li>

<li><a href="https://urho3d.io/">urho3d</a>
<ul class="org-ul">
<li>(cpp, lua)</li>
<li>{csharp}</li>
<li>[linux, mac, win, mobile, web,&#x2026;]</li>
</ul></li>

<li><a href="https://www.stride3d.net/">stride</a>
<ul class="org-ul">
<li>(csharp)</li>
<li>[*linux, *mac, win, mobile,&#x2026;] * can only target</li>
</ul></li>

<li><a href="https://www.esenthel.com/">esenthel</a>
<ul class="org-ul">
<li>(cpp)</li>
<li>[linux, mac, win, mobile]</li>
</ul></li>

<li><a href="https://solar2d.com/">solar2d (formerly corona sdk)</a>
<ul class="org-ul">
<li>(lua)</li>
<li>[linux, mac, win, mobile, web,&#x2026;]</li>
</ul></li>

<li><a href="https://www.cafu.de/">cafu engine</a>
<ul class="org-ul">
<li>(cpp, lua)</li>
<li>[linux, wim]</li>
</ul></li>

<li><a href="https://castle-engine.io/">castle game engine</a>
<ul class="org-ul">
<li>(pascal)</li>
<li>[linux, mac, win, mobile, consoles,&#x2026;]</li>
</ul></li>

<li><a href="https://springrts.com/">spring rts engine</a>
<ul class="org-ul">
<li>(lua)</li>
<li>[linux, mac, win]</li>
</ul></li>

<li><a href="https://www.gbstudio.dev/">gb studio</a>
<ul class="org-ul">
<li>(codeless)</li>
<li>[linux, mac, win, web, game boy]</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgc6373b8" class="outline-2">
<h2 id="orgc6373b8">game engine (-editor)</h2>
<div class="outline-text-2" id="text-orgc6373b8">
<ul class="org-ul">
<li><a href="https://heaps.io/">heaps</a>
<ul class="org-ul">
<li>(haxe)</li>
<li>[linux, mac, win, mobile, web, consoles]</li>
</ul></li>

<li><a href="https://haxeflixel.com/">haxeflixel</a>
<ul class="org-ul">
<li>(haxe)</li>
<li>[linux, mac, win, web]</li>
</ul></li>

<li><a href="https://wickedengine.net/">wicked engine</a>
<ul class="org-ul">
<li>(cpp, lua)</li>
<li>[linux, win]</li>
</ul></li>

<li><a href="https://www.orx-project.org/">orx</a>
<ul class="org-ul">
<li>(c/cpp)</li>
<li>[linux, mac, win, mobile]</li>
</ul></li>

<li><a href="https://bevyengine.org/">bevy</a>
<ul class="org-ul">
<li>(rust)</li>
<li>[linux, mac, win, ]</li>
</ul></li>

<li><a href="https://dragonruby.itch.io/dragonruby-gtk">dragonruby gtk</a>
<ul class="org-ul">
<li>(ruby)</li>
<li>[linux, mac, win, web, *mobile, *consoles] * only for premium subscription</li>
</ul></li>

<li><a href="https://ncine.github.io/">ncine</a>
<ul class="org-ul">
<li>(cpp, lua)</li>
<li>[linux, mac, win, web, android]</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org1e8bd5b" class="outline-2">
<h2 id="org1e8bd5b">fantasy consoles</h2>
<div class="outline-text-2" id="text-org1e8bd5b">
<ul class="org-ul">
<li><a href="https://www.lexaloffle.com/pico-8.php">pico8</a>
<ul class="org-ul">
<li>(lua)</li>
<li>[linux, mac, win, web, carts(loaded directly into fantasy console)]</li>
</ul></li>

<li><a href="https://pixelvision8.github.io/Website/">pixel vision 8</a>
<ul class="org-ul">
<li>(csharp, lua)</li>
<li>[*linux, *mac, *win,pv8(fantasy console cartrige)] * development platforms</li>
</ul></li>

<li><a href="https://tic80.com/">tic-80</a>
<ul class="org-ul">
<li>(lua)</li>
<li>[*linux, *win, *mobile, carts(loaded directly into fantasy consoles)] * development platforms</li>
</ul></li>

<li><a href="https://ramilego4game.itch.io/liko12">liko-12</a>
<ul class="org-ul">
<li>(lua)</li>
<li>[*linux, *mac, *win, *love2d, carts(loaded directly into fantasy console)] * development platforms</li>
</ul></li>

<li><a href="https://lowresnx.inutilis.com/">lowres nx</a>
<ul class="org-ul">
<li>(basic)</li>
<li>[*linux, *mac, *win, carts(loaded directly into fantasy console)] * development platforms</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgec88d1f" class="outline-2">
<h2 id="orgec88d1f">others</h2>
<div class="outline-text-2" id="text-orgec88d1f">
<ul class="org-ul">
<li><a href="https://blitzmax.org/">blitzmax ng</a>
<ul class="org-ul">
<li>cross platform programming language, great for making games, built in tools for game and app development</li>
</ul></li>

<li><a href="https://www.cerberus-x.com/">cerberus x</a>
<ul class="org-ul">
<li>cross platform programming language, great for making games, built in tools for game and app development</li>
</ul></li>

<li><a href="https://rcbasic.com/">rcbasic</a>
<ul class="org-ul">
<li>cross platform programming language, great for making games, built in tools for game and app development</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org743fc11" class="outline-2">
<h2 id="org743fc11">software</h2>
<div class="outline-text-2" id="text-org743fc11">
<ul class="org-ul">
<li><a href="https://www.mapeditor.org/">tiled</a>
<ul class="org-ul">
<li>tilemap editor, many output formats</li>
<li>[linux, mac, win]</li>
</ul></li>

<li><a href="https://www.vim.org/">vim</a>
<ul class="org-ul">
<li>commendline based text editor</li>
</ul></li>

<li><a href="https://www.gnu.org/software/emacs/">emacs</a>
<ul class="org-ul">
<li>more the just text editor&#x2026;</li>
</ul></li>

<li><a href="https://lite-xl.github.io/">lite-xl</a>
<ul class="org-ul">
<li>small text editor (mostly) made in lua</li>
</ul></li>

<li><a href="http://grafx2.chez.com/">grafx2</a>
<ul class="org-ul">
<li>retro pixel art tool</li>
</ul></li>

<li><a href="https://inkscape.org/">inkscape</a>
<ul class="org-ul">
<li>vector graphics tool</li>
</ul></li>

<li><a href="https://github.com/Captain4LK/SoftLK-tools">slk img2pixel</a>
<ul class="org-ul">
<li>tool for converting images to pixel art</li>
</ul></li>

<li><a href="https://wiitd.itch.io/yata">yata</a>
<ul class="org-ul">
<li>todo app</li>
<li>self-advertisement</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Michał &rsquo;wiitd&rsquo; KM</p>
<p class="date">Created: 2021-10-25 pon 19:26</p>
</div>
</body>
</html>
